Revit 2027 API
FilledRegionType.IsMasking Property
 If true then the FilledRegion will cover the lines and edges of objects behind it. If false then lines and edges will remain visible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsMasking { get; set; }
Public Property IsMasking As Boolean
	Get
	Set
public:
property bool IsMasking {
	bool get ();
	void set (bool value);
}
member IsMasking : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
ArgumentException |  When setting this property: In a family a FilledRegionType with a solid fill pattern isMasking must always be true.
See Also
Reference
FilledRegionType Class
Autodesk.Revit.DB Namespace